const state = () => {
  return {
    news: [
      {
        title: 'Заголовок новости',
        preview: 'Lorem Ipsum - это текст-"рыба", часто \n' +
          'используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной "рыбой" для текстов на латинице с начала XVI века. В то время некий создал большую...',
        text: 'Lorem Ipsum - это текст-"рыба", часто \n' +
          'используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной "рыбой" для текстов на латинице с начала XVI века. В то время некий создал большую...',
        previewImg: require('@/assets/news/news-img.png')
      },
      {
        title: 'Заголовок новости',
        preview: 'Lorem Ipsum - это текст-"рыба", часто \n' +
          'используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной "рыбой" для текстов на латинице с начала XVI века. В то время некий создал большую...',
        text: 'Lorem Ipsum - это текст-"рыба", часто \n' +
          'используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной "рыбой" для текстов на латинице с начала XVI века. В то время некий создал большую...',
        previewImg: require('@/assets/news/news-img.png')
      },
      {
        title: 'Заголовок новости',
        preview: 'Lorem Ipsum - это текст-"рыба", часто \n' +
          'используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной "рыбой" для текстов на латинице с начала XVI века. В то время некий создал большую...',
        text: 'Lorem Ipsum - это текст-"рыба", часто \n' +
          'используемый в печати и вэб-дизайне. Lorem Ipsum является стандартной "рыбой" для текстов на латинице с начала XVI века. В то время некий создал большую...',
        previewImg: require('@/assets/news/news-img.png')
      }
    ]
  }
}

export default {
  state
}
